# FaceroofOffsetParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FaceroofOffsetParam Property
ParameterTypeId Class See Also
---
"Level Offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FaceroofOffsetParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FaceroofOffsetParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FaceroofOffsetParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace